/* 
  KPKLocalizable.strings
  MacPass

  Created by Michael Starke on 20/12/13.
  Copyright (c) 2013 HicknHack Software GmbH. All rights reserved.
*/

"SET_TITLE" = "Modifica Titolo";
"SET_USERNAME" = "Modifica Nome Utente";
"SET_PASSWORD" = "Modifica Password";
"SET_URL" = "Modifica URL";
"SET_NOTES" = "Modifica Note";

"DATABASE" = "Database";
"EMAIL" = "EMail";
"GENERAL" = "Generale";
"HOMEBANKING" = "Homebanking";
"INTERNET" = "Internet";
"NETWORK" = "Rete";
"TRASH" = "Cestino";
"WINDOWS" = "Windows";

/* Copy */
"KPK_GROUP_COPY_%@" = "%@ Copia";
"KPK_ENTRY_COPY_%@" = "%@ Copia";

/* Validation Errors */
"ERROR_WINDOW_TITLE_VALIDATION_FAILED" = "Il Formato del Titolo della Finestra non é Valido!";
"ERROR_ATTRIBUTE_KEY_VALIDATION_FAILED" = "The Attribute Key is not unique!";
"ERROR_AUTOTYPE_SEQUENCE_VALIDATION_FAILED" = "Sequenza di AutoType non Valida!";

/* Errors */
"ERROR_CORRUPT_TREE" = "La struttura interna del file é corrotta!";
"ERROR_INVALID_FIELD_SIZE" = "Taglia dati incorretta. Password errata?";
"ERROR_INVALID_FIELD_TYPE" = "Campo dati sconosciuto. Password errata?";
"ERROR_UNSUPPORTED_DATABASER_VERSION" = "Versione del database non supportata";
"ERROR_UNSUPPORTED_CHIPHER" = "Algoritmo di cifratura non supportato";
"ERROR_UNKNOWN_FILE_FORMAT" = "Formato del file sconosciuto";
"ERROR_HEADER_CORRUPTED" = "Intestazione corrotta";
"ERROR_UNSUPPORTED_KDBX_COMPRESSION_ALGORITHM" = "Algoritmo di compressione non supportato";
"ERROR_UNSUPPORTED_KDBX_RANDOM_STREAM" = "Flusso aleatorio non supportato";
"ERROR_INTEGRITY_CHECK_FAILED" = "L'integrità del database non é assicurata";
"ERROR_PASSWORD_OR_KEYFILE_WRONG" = "La password e/o la chiave sono errati";
"ERROR_KEEPASSFILE_ELEMENT_MISSING" = "Elemento KeePassFile mancante dal file XML";
"ERROR_ROOT_ELEMENT_MISSING" = "Il file XML non contiene un nodo root";
"ERROR_GROUP_ELEMENT_MISSING" = "Il file XML non contiene un nodo Gruppo";
"ERROR_HEADER_HASH_MISSMATCH" = "La hash dell'intestazione non corrisponde. File corrotto";
"ERROR_XML_KEYFILE_WITHOUT_KEY_ELEMENT" = "Il file chiave XML non contiene l'elemento chiave";
"ERROR_XML_KEYFILE_WITHOUT_DATA_ELEMENT" = "Il file chiave XML non contiene l'elemento dati";
"ERROR_XML_KEYFILE_DATA_PARSING_ERROR" = "Impossibile leggere i dati dal file chiave XML";
"ERROR_HEADER_HASH_VERIFICATION_FAILED" = "La hash dell'intestazione del database é errata, l'integrità dei dati potrebbe essere compromessa!";
